{
  "recommendations": {
    "metadata-based-recommendation-optimization": {
      "related": [
        {
          "slug": "ai-content-recommendation-system",
          "score": 0.94,
          "reason": {
            "ko": "두 글 모두 추천 시스템 구축을 다루며, API 비용 최적화와 메타데이터 활용이라는 실전 과제를 해결합니다.",
            "ja": "両記事とも推薦システム構築を扱い、APIコスト最適化とメタデータ活用という実践課題を解決します。",
            "en": "Both posts cover recommendation system development and solve practical challenges of API cost optimization and metadata utilization."
          },
          "type": "similar-topic"
        },
        {
          "slug": "self-healing-ai-systems",
          "score": 0.81,
          "reason": {
            "ko": "AI 시스템의 안정성과 효율성을 높이는 아키텍처 설계를 다루며, 자동화된 최적화 전략을 공유합니다.",
            "ja": "AIシステムの安定性と効率性を高めるアーキテクチャ設計を扱い、自動化された最適化戦略を共有します。",
            "en": "Covers AI system architecture design for stability and efficiency, sharing automated optimization strategies."
          },
          "type": "complementary"
        },
        {
          "slug": "ai-agent-collaboration-patterns",
          "score": 0.76,
          "reason": {
            "ko": "멀티 에이전트 시스템의 효율적인 설계와 최적화 패턴을 다루어 시스템 아키텍처 관점에서 연결됩니다.",
            "ja": "マルチエージェントシステムの効率的な設計と最適化パターンを扱い、システムアーキテクチャの観点から繋がります。",
            "en": "Covers efficient multi-agent system design and optimization patterns, connecting from a system architecture perspective."
          },
          "type": "complementary"
        },
        {
          "slug": "chrome-devtools-mcp-performance",
          "score": 0.68,
          "reason": {
            "ko": "성능 측정과 최적화라는 공통 주제를 다루며, 데이터 기반 개선 접근법을 공유합니다.",
            "ja": "パフォーマンス測定と最適化という共通テーマを扱い、データ駆動型改善アプローチを共有します。",
            "en": "Shares the common theme of performance measurement and optimization with data-driven improvement approaches."
          },
          "type": "similar-topic"
        },
        {
          "slug": "specification-driven-development",
          "score": 0.64,
          "reason": {
            "ko": "체계적인 개발 방법론과 아키텍처 설계 원칙을 다루어 시스템 설계 관점에서 보완적입니다.",
            "ja": "体系的な開発方法論とアーキテクチャ設計原則を扱い、システム設計の観点から補完的です。",
            "en": "Complementary from a system design perspective, covering systematic development methodology and architecture design principles."
          },
          "type": "complementary"
        }
      ],
      "generatedAt": "2025-10-15T15:00:00Z",
      "evaluatedBy": "claude-sonnet-4.5"
    },
    "self-healing-ai-systems": {
      "related": [
        {
          "slug": "ai-agent-collaboration-patterns",
          "score": 0.89,
          "reason": {
            "ko": "두 글 모두 고급 AI 시스템 아키텍처를 다루며, 복잡한 AI 시스템의 안정성과 협업 패턴을 설계합니다.",
            "ja": "両記事とも高度なAIシステムアーキテクチャを扱い、複雑なAIシステムの安定性と協働パターンを設計します。",
            "en": "Both posts cover advanced AI system architecture, designing stability and collaboration patterns for complex AI systems."
          },
          "type": "similar-topic"
        },
        {
          "slug": "specification-driven-development",
          "score": 0.78,
          "reason": {
            "ko": "AI 시스템의 체계적 설계와 구현 방법론을 다루며, 자동 복구와 명세 기반 개발이 연결됩니다.",
            "ja": "AIシステムの体系的設計と実装方法論を扱い、自動復旧と仕様駆動開発が繋がります。",
            "en": "Covers systematic AI system design and implementation methodology, connecting auto-recovery with specification-driven development."
          },
          "type": "complementary"
        },
        {
          "slug": "ai-content-recommendation-system",
          "score": 0.72,
          "reason": {
            "ko": "AI 시스템의 실전 구현과 안정성 확보 방법을 다루며, 프로덕션 환경의 AI 운영을 공유합니다.",
            "ja": "AIシステムの実践実装と安定性確保方法を扱い、プロダクション環境のAI運用を共有します。",
            "en": "Covers practical AI system implementation and stability assurance, sharing production AI operations."
          },
          "type": "complementary"
        },
        {
          "slug": "chrome-devtools-mcp-performance",
          "score": 0.66,
          "reason": {
            "ko": "시스템 모니터링과 자동 최적화라는 공통 주제를 다루며, DevOps 관점에서 연결됩니다.",
            "ja": "システム監視と自動最適化という共通テーマを扱い、DevOpsの観点から繋がります。",
            "en": "Shares common themes of system monitoring and automated optimization, connecting from a DevOps perspective."
          },
          "type": "similar-topic"
        },
        {
          "slug": "metadata-based-recommendation-optimization",
          "score": 0.63,
          "reason": {
            "ko": "시스템 최적화와 효율성 개선 전략을 다루며, 자동화된 성능 향상 방법을 공유합니다.",
            "ja": "システム最適化と効率性改善戦略を扱い、自動化されたパフォーマンス向上方法を共有します。",
            "en": "Covers system optimization and efficiency improvement strategies, sharing automated performance enhancement methods."
          },
          "type": "complementary"
        }
      ],
      "generatedAt": "2025-10-15T15:00:00Z",
      "evaluatedBy": "claude-sonnet-4.5"
    },
    "ai-agent-collaboration-patterns": {
      "related": [
        {
          "slug": "self-healing-ai-systems",
          "score": 0.89,
          "reason": {
            "ko": "고급 AI 시스템 설계를 다루며, 멀티 에이전트 협업과 자가 치유가 함께 동작하는 복잡한 시스템을 구축합니다.",
            "ja": "高度なAIシステム設計を扱い、マルチエージェント協働と自己修復が共に動作する複雑なシステムを構築します。",
            "en": "Covers advanced AI system design, building complex systems where multi-agent collaboration and self-healing work together."
          },
          "type": "similar-topic"
        },
        {
          "slug": "specification-driven-development",
          "score": 0.82,
          "reason": {
            "ko": "AI 에이전트의 체계적 설계와 구현 방법론을 다루며, 협업 패턴과 명세 기반 개발이 자연스럽게 연결됩니다.",
            "ja": "AIエージェントの体系的設計と実装方法論を扱い、協働パターンと仕様駆動開発が自然に繋がります。",
            "en": "Covers systematic AI agent design and implementation methodology, naturally connecting collaboration patterns with specification-driven development."
          },
          "type": "complementary"
        },
        {
          "slug": "ai-content-recommendation-system",
          "score": 0.74,
          "reason": {
            "ko": "AI 시스템의 실전 구현 사례를 다루며, 에이전트 협업이 콘텐츠 추천에 어떻게 활용되는지 보여줍니다.",
            "ja": "AIシステムの実践実装事例を扱い、エージェント協働がコンテンツ推薦にどう活用されるかを示します。",
            "en": "Covers practical AI system implementation, showing how agent collaboration is utilized in content recommendation."
          },
          "type": "complementary"
        },
        {
          "slug": "ai-agent-notion-mcp-automation",
          "score": 0.71,
          "reason": {
            "ko": "AI 에이전트의 실전 활용 사례를 다루며, 협업 패턴이 실제 워크플로우에서 어떻게 적용되는지 보여줍니다.",
            "ja": "AIエージェントの実践活用事例を扱い、協働パターンが実際のワークフローでどう適用されるかを示します。",
            "en": "Covers practical AI agent use cases, showing how collaboration patterns are applied in real workflows."
          },
          "type": "next-step"
        },
        {
          "slug": "metadata-based-recommendation-optimization",
          "score": 0.68,
          "reason": {
            "ko": "복잡한 AI 시스템의 아키텍처 설계와 최적화 전략을 공유하며, 시스템 설계 관점에서 보완적입니다.",
            "ja": "複雑なAIシステムのアーキテクチャ設計と最適化戦略を共有し、システム設計の観点から補完的です。",
            "en": "Shares complex AI system architecture design and optimization strategies, complementary from a system design perspective."
          },
          "type": "complementary"
        }
      ],
      "generatedAt": "2025-10-15T15:00:00Z",
      "evaluatedBy": "claude-sonnet-4.5"
    },
    "astro-scheduled-publishing": {
      "related": [
        {
          "slug": "blog-launch-analysis-report",
          "score": 0.76,
          "reason": {
            "ko": "Astro 블로그 운영의 실전 기법을 다루며, 예약 발행과 분석 시스템이 블로그 자동화를 완성합니다.",
            "ja": "Astroブログ運営の実践技法を扱い、予約投稿と分析システムがブログ自動化を完成させます。",
            "en": "Covers practical Astro blog operation techniques, completing blog automation with scheduled publishing and analytics systems."
          },
          "type": "complementary"
        },
        {
          "slug": "llm-blog-automation",
          "score": 0.72,
          "reason": {
            "ko": "블로그 콘텐츠 자동화의 전체 파이프라인을 다루며, 예약 발행이 자동화 워크플로우를 완성합니다.",
            "ja": "ブログコンテンツ自動化の全体パイプラインを扱い、予約投稿が自動化ワークフローを完成させます。",
            "en": "Covers the complete blog content automation pipeline, with scheduled publishing completing the automation workflow."
          },
          "type": "complementary"
        },
        {
          "slug": "google-analytics-mcp-automation",
          "score": 0.64,
          "reason": {
            "ko": "블로그 운영 자동화의 다른 측면을 다루며, 발행 스케줄링과 분석 자동화가 함께 블로그 시스템을 구성합니다.",
            "ja": "ブログ運営自動化の別の側面を扱い、投稿スケジューリングと分析自動化が共にブログシステムを構成します。",
            "en": "Covers another aspect of blog operation automation, with publishing scheduling and analytics automation together forming the blog system."
          },
          "type": "complementary"
        },
        {
          "slug": "chrome-devtools-mcp-performance",
          "score": 0.58,
          "reason": {
            "ko": "GitHub Actions와 자동화 파이프라인을 활용한 DevOps 실천 사례를 공유합니다.",
            "ja": "GitHub Actionsと自動化パイプラインを活用したDevOps実践事例を共有します。",
            "en": "Shares DevOps practices using GitHub Actions and automation pipelines."
          },
          "type": "similar-topic"
        },
        {
          "slug": "ai-presentation-automation",
          "score": 0.52,
          "reason": {
            "ko": "자동화 워크플로우와 생산성 향상 전략을 다루며, 콘텐츠 스케줄링의 실전 활용을 보여줍니다.",
            "ja": "自動化ワークフローと生産性向上戦略を扱い、コンテンツスケジューリングの実践活用を示します。",
            "en": "Covers automation workflows and productivity strategies, showing practical content scheduling applications."
          },
          "type": "similar-topic"
        }
      ],
      "generatedAt": "2025-10-15T15:00:00Z",
      "evaluatedBy": "claude-sonnet-4.5"
    },
    "specification-driven-development": {
      "related": [
        {
          "slug": "ai-agent-collaboration-patterns",
          "score": 0.82,
          "reason": {
            "ko": "AI 시대의 개발 방법론과 시스템 설계를 다루며, 명세 기반 개발과 에이전트 협업이 현대 개발의 핵심을 형성합니다.",
            "ja": "AI時代の開発方法論とシステム設計を扱い、仕様駆動開発とエージェント協働が現代開発の核心を形成します。",
            "en": "Covers AI-era development methodology and system design, with specification-driven development and agent collaboration forming the core of modern development."
          },
          "type": "similar-topic"
        },
        {
          "slug": "self-healing-ai-systems",
          "score": 0.78,
          "reason": {
            "ko": "복잡한 AI 시스템의 설계 원칙과 구현 방법론을 다루며, 체계적 접근법을 공유합니다.",
            "ja": "複雑なAIシステムの設計原則と実装方法論を扱い、体系的アプローチを共有します。",
            "en": "Covers design principles and implementation methodology for complex AI systems, sharing systematic approaches."
          },
          "type": "complementary"
        },
        {
          "slug": "claude-code-best-practices",
          "score": 0.71,
          "reason": {
            "ko": "AI 기반 개발 워크플로우의 베스트 프랙티스를 다루며, SDD가 Claude Code 활용의 기초가 됩니다.",
            "ja": "AI基盤開発ワークフローのベストプラクティスを扱い、SDDがClaude Code活用の基礎となります。",
            "en": "Covers AI-based development workflow best practices, with SDD forming the foundation for Claude Code utilization."
          },
          "type": "prerequisite"
        },
        {
          "slug": "ai-content-recommendation-system",
          "score": 0.69,
          "reason": {
            "ko": "AI 시스템 설계의 실전 사례를 다루며, 명세 기반 접근법이 실제 프로젝트에서 어떻게 적용되는지 보여줍니다.",
            "ja": "AIシステム設計の実践事例を扱い、仕様基盤アプローチが実際のプロジェクトでどう適用されるかを示します。",
            "en": "Covers practical AI system design cases, showing how specification-based approaches are applied in real projects."
          },
          "type": "next-step"
        },
        {
          "slug": "metadata-based-recommendation-optimization",
          "score": 0.64,
          "reason": {
            "ko": "시스템 아키텍처와 최적화 전략을 다루며, 설계 방법론이 성능 개선으로 이어집니다.",
            "ja": "システムアーキテクチャと最適化戦略を扱い、設計方法論がパフォーマンス改善に繋がります。",
            "en": "Covers system architecture and optimization strategies, with design methodology leading to performance improvements."
          },
          "type": "complementary"
        }
      ],
      "generatedAt": "2025-10-15T15:00:00Z",
      "evaluatedBy": "claude-sonnet-4.5"
    },
    "ai-content-recommendation-system": {
      "related": [
        {
          "slug": "metadata-based-recommendation-optimization",
          "score": 0.94,
          "reason": {
            "ko": "추천 시스템의 구축과 최적화를 단계적으로 다루며, 의미론적 추천에서 성능 최적화로 자연스럽게 발전합니다.",
            "ja": "推薦システムの構築と最適化を段階的に扱い、意味論的推薦からパフォーマンス最適化へ自然に発展します。",
            "en": "Covers recommendation system building and optimization progressively, naturally evolving from semantic recommendations to performance optimization."
          },
          "type": "series"
        },
        {
          "slug": "llm-blog-automation",
          "score": 0.83,
          "reason": {
            "ko": "Claude LLM 활용의 실전 사례를 다루며, 콘텐츠 생성과 추천이라는 블로그 자동화의 핵심 기능을 다룹니다.",
            "ja": "Claude LLM活用の実践事例を扱い、コンテンツ生成と推薦というブログ自動化の核心機能を扱います。",
            "en": "Covers practical Claude LLM use cases, addressing core blog automation features of content generation and recommendation."
          },
          "type": "similar-topic"
        },
        {
          "slug": "ai-agent-collaboration-patterns",
          "score": 0.74,
          "reason": {
            "ko": "AI 시스템의 고급 설계 패턴을 다루며, 추천 시스템이 멀티 에이전트 환경에서 활용될 수 있습니다.",
            "ja": "AIシステムの高度な設計パターンを扱い、推薦システムがマルチエージェント環境で活用できます。",
            "en": "Covers advanced AI system design patterns, where recommendation systems can be utilized in multi-agent environments."
          },
          "type": "complementary"
        },
        {
          "slug": "specification-driven-development",
          "score": 0.69,
          "reason": {
            "ko": "AI 시스템의 체계적 설계 방법론을 다루며, 추천 시스템 구축의 기초가 됩니다.",
            "ja": "AIシステムの体系的設計方法論を扱い、推薦システム構築の基礎となります。",
            "en": "Covers systematic AI system design methodology, forming the foundation for recommendation system development."
          },
          "type": "prerequisite"
        },
        {
          "slug": "self-healing-ai-systems",
          "score": 0.66,
          "reason": {
            "ko": "프로덕션 AI 시스템의 안정성 확보 방법을 다루며, 추천 시스템 운영에 필요한 복원력을 제공합니다.",
            "ja": "プロダクションAIシステムの安定性確保方法を扱い、推薦システム運用に必要な復元力を提供します。",
            "en": "Covers production AI system stability assurance, providing resilience needed for recommendation system operations."
          },
          "type": "complementary"
        }
      ],
      "generatedAt": "2025-10-15T15:00:00Z",
      "evaluatedBy": "claude-sonnet-4.5"
    },
    "chrome-devtools-mcp-performance": {
      "related": [
        {
          "slug": "claude-code-web-automation",
          "score": 0.91,
          "reason": {
            "ko": "두 글 모두 MCP를 활용한 브라우저 자동화를 다루며, Chrome DevTools와 Playwright의 강력한 통합을 보여줍니다.",
            "ja": "両記事ともMCPを活用したブラウザ自動化を扱い、Chrome DevToolsとPlaywrightの強力な統合を示します。",
            "en": "Both posts cover MCP-based browser automation, demonstrating powerful integration of Chrome DevTools and Playwright."
          },
          "type": "similar-topic"
        },
        {
          "slug": "google-analytics-mcp-automation",
          "score": 0.76,
          "reason": {
            "ko": "성능 측정 후 데이터 분석으로 이어지는 웹 최적화 파이프라인을 완성합니다.",
            "ja": "パフォーマンス測定後のデータ分析に繋がるWeb最適化パイプラインを完成させます。",
            "en": "Completes the web optimization pipeline from performance measurement to data analysis."
          },
          "type": "complementary"
        },
        {
          "slug": "ai-agent-notion-mcp-automation",
          "score": 0.68,
          "reason": {
            "ko": "MCP 서버 활용의 다양한 사례를 다루며, 브라우저 자동화와 데이터 관리 자동화를 공유합니다.",
            "ja": "MCPサーバー活用の多様な事例を扱い、ブラウザ自動化とデータ管理自動化を共有します。",
            "en": "Covers various MCP server use cases, sharing browser automation and data management automation."
          },
          "type": "similar-topic"
        },
        {
          "slug": "metadata-based-recommendation-optimization",
          "score": 0.68,
          "reason": {
            "ko": "성능 최적화와 비용 효율화라는 공통 목표를 다루며, 측정과 개선의 체계적 접근법을 공유합니다.",
            "ja": "パフォーマンス最適化とコスト効率化という共通目標を扱い、測定と改善の体系的アプローチを共有します。",
            "en": "Shares common goals of performance optimization and cost efficiency, with systematic measurement and improvement approaches."
          },
          "type": "complementary"
        },
        {
          "slug": "astro-scheduled-publishing",
          "score": 0.58,
          "reason": {
            "ko": "GitHub Actions와 CI/CD 자동화를 다루며, DevOps 관점에서 웹 성능 최적화와 연결됩니다.",
            "ja": "GitHub ActionsとCI/CD自動化を扱い、DevOpsの観点からWebパフォーマンス最適化と繋がります。",
            "en": "Covers GitHub Actions and CI/CD automation, connecting to web performance optimization from a DevOps perspective."
          },
          "type": "similar-topic"
        }
      ],
      "generatedAt": "2025-10-15T15:00:00Z",
      "evaluatedBy": "claude-sonnet-4.5"
    },
    "ai-agent-notion-mcp-automation": {
      "related": [
        {
          "slug": "google-analytics-mcp-automation",
          "score": 0.87,
          "reason": {
            "ko": "두 글 모두 MCP 서버를 활용한 데이터 자동화를 다루며, Notion과 Analytics의 서로 다른 데이터 소스를 통합합니다.",
            "ja": "両記事ともMCPサーバーを活用したデータ自動化を扱い、NotionとAnalyticsの異なるデータソースを統合します。",
            "en": "Both posts cover MCP server-based data automation, integrating different data sources from Notion and Analytics."
          },
          "type": "similar-topic"
        },
        {
          "slug": "claude-code-web-automation",
          "score": 0.81,
          "reason": {
            "ko": "Claude Code와 MCP를 활용한 자동화 워크플로우를 다루며, 웹 자동화와 데이터 관리 자동화가 보완적입니다.",
            "ja": "Claude CodeとMCPを活用した自動化ワークフローを扱い、Web自動化とデータ管理自動化が補完的です。",
            "en": "Covers automation workflows using Claude Code and MCP, with web automation and data management automation being complementary."
          },
          "type": "complementary"
        },
        {
          "slug": "ai-agent-collaboration-patterns",
          "score": 0.71,
          "reason": {
            "ko": "AI 에이전트 협업의 실전 사례를 다루며, Notion 자동화가 멀티 에이전트 시스템의 구체적 활용 예시가 됩니다.",
            "ja": "AIエージェント協働の実践事例を扱い、Notion自動化がマルチエージェントシステムの具体的活用例となります。",
            "en": "Covers practical AI agent collaboration cases, with Notion automation being a concrete example of multi-agent systems."
          },
          "type": "next-step"
        },
        {
          "slug": "chrome-devtools-mcp-performance",
          "score": 0.68,
          "reason": {
            "ko": "MCP 서버의 다양한 활용 사례를 다루며, 브라우저 자동화와 API 통합의 서로 다른 접근법을 보여줍니다.",
            "ja": "MCPサーバーの多様な活用事例を扱い、ブラウザ自動化とAPI統合の異なるアプローチを示します。",
            "en": "Covers various MCP server use cases, showing different approaches to browser automation and API integration."
          },
          "type": "similar-topic"
        },
        {
          "slug": "llm-blog-automation",
          "score": 0.64,
          "reason": {
            "ko": "AI를 활용한 워크플로우 자동화를 다루며, Notion 통합과 블로그 자동화가 지식 관리 시스템을 형성합니다.",
            "ja": "AIを活用したワークフロー自動化を扱い、Notion統合とブログ自動化が知識管理システムを形成します。",
            "en": "Covers AI-powered workflow automation, with Notion integration and blog automation forming a knowledge management system."
          },
          "type": "complementary"
        }
      ],
      "generatedAt": "2025-10-15T15:00:00Z",
      "evaluatedBy": "claude-sonnet-4.5"
    },
    "ai-presentation-automation": {
      "related": [
        {
          "slug": "llm-blog-automation",
          "score": 0.86,
          "reason": {
            "ko": "Claude Code를 활용한 콘텐츠 자동화를 다루며, 프레젠테이션과 블로그 포스트 생성이라는 서로 다른 콘텐츠 형식에 동일한 자동화 원칙을 적용합니다.",
            "ja": "Claude Codeを活用したコンテンツ自動化を扱い、プレゼンテーションとブログ投稿生成という異なるコンテンツ形式に同じ自動化原則を適用します。",
            "en": "Covers Claude Code-based content automation, applying the same automation principles to different content formats: presentations and blog posts."
          },
          "type": "similar-topic"
        },
        {
          "slug": "claude-code-best-practices",
          "score": 0.78,
          "reason": {
            "ko": "Claude Code의 실전 활용 사례를 다루며, 베스트 프랙티스가 프레젠테이션 자동화로 구체화됩니다.",
            "ja": "Claude Codeの実践活用事例を扱い、ベストプラクティスがプレゼンテーション自動化で具体化されます。",
            "en": "Covers practical Claude Code use cases, with best practices being concretized in presentation automation."
          },
          "type": "next-step"
        },
        {
          "slug": "google-analytics-mcp-automation",
          "score": 0.61,
          "reason": {
            "ko": "AI 기반 자동화 워크플로우를 다루며, 콘텐츠 생성과 데이터 분석이라는 생산성 향상의 다른 측면을 보여줍니다.",
            "ja": "AI基盤自動化ワークフローを扱い、コンテンツ生成とデータ分析という生産性向上の異なる側面を示します。",
            "en": "Covers AI-based automation workflows, showing different aspects of productivity improvement: content generation and data analysis."
          },
          "type": "complementary"
        },
        {
          "slug": "ai-agent-notion-mcp-automation",
          "score": 0.59,
          "reason": {
            "ko": "AI 에이전트를 활용한 작업 자동화를 다루며, 프레젠테이션 생성과 지식 관리가 워크플로우 효율화에 기여합니다.",
            "ja": "AIエージェントを活用した作業自動化を扱い、プレゼンテーション生成と知識管理がワークフロー効率化に貢献します。",
            "en": "Covers work automation using AI agents, with presentation generation and knowledge management contributing to workflow efficiency."
          },
          "type": "similar-topic"
        },
        {
          "slug": "astro-scheduled-publishing",
          "score": 0.52,
          "reason": {
            "ko": "콘텐츠 자동화와 스케줄링을 다루며, 생산성 향상을 위한 자동화 전략을 공유합니다.",
            "ja": "コンテンツ自動化とスケジューリングを扱い、生産性向上のための自動化戦略を共有します。",
            "en": "Covers content automation and scheduling, sharing automation strategies for productivity improvement."
          },
          "type": "complementary"
        }
      ],
      "generatedAt": "2025-10-15T15:00:00Z",
      "evaluatedBy": "claude-sonnet-4.5"
    },
    "claude-code-web-automation": {
      "related": [
        {
          "slug": "chrome-devtools-mcp-performance",
          "score": 0.91,
          "reason": {
            "ko": "두 글 모두 MCP 기반 브라우저 자동화를 다루며, Playwright와 Chrome DevTools의 통합 활용을 보여줍니다.",
            "ja": "両記事ともMCP基盤ブラウザ自動化を扱い、PlaywrightとChrome DevToolsの統合活用を示します。",
            "en": "Both posts cover MCP-based browser automation, demonstrating integrated use of Playwright and Chrome DevTools."
          },
          "type": "similar-topic"
        },
        {
          "slug": "claude-code-best-practices",
          "score": 0.84,
          "reason": {
            "ko": "Claude Code의 베스트 프랙티스를 웹 자동화라는 구체적 사례로 적용하여, 이론에서 실전으로 자연스럽게 연결됩니다.",
            "ja": "Claude CodeのベストプラクティスをWeb自動化という具体的事例で適用し、理論から実践へ自然に繋がります。",
            "en": "Applies Claude Code best practices to concrete web automation cases, naturally connecting theory to practice."
          },
          "type": "series"
        },
        {
          "slug": "ai-agent-notion-mcp-automation",
          "score": 0.81,
          "reason": {
            "ko": "MCP 서버를 활용한 자동화 워크플로우를 다루며, 웹 자동화와 API 통합의 서로 다른 활용 사례를 보여줍니다.",
            "ja": "MCPサーバーを活用した自動化ワークフローを扱い、Web自動化とAPI統合の異なる活用事例を示します。",
            "en": "Covers automation workflows using MCP servers, showing different use cases of web automation and API integration."
          },
          "type": "similar-topic"
        },
        {
          "slug": "google-analytics-mcp-automation",
          "score": 0.73,
          "reason": {
            "ko": "Claude Code와 MCP의 실전 활용을 다루며, 브라우저 자동화와 데이터 분석이 개발 워크플로우를 완성합니다.",
            "ja": "Claude CodeとMCPの実践活用を扱い、ブラウザ自動化とデータ分析が開発ワークフローを完成させます。",
            "en": "Covers practical use of Claude Code and MCP, with browser automation and data analysis completing the development workflow."
          },
          "type": "complementary"
        },
        {
          "slug": "llm-blog-automation",
          "score": 0.69,
          "reason": {
            "ko": "Claude Code 기반 자동화를 다루며, 웹 자동화와 콘텐츠 자동화가 AI 워크플로우의 다른 측면을 보여줍니다.",
            "ja": "Claude Code基盤自動化を扱い、Web自動化とコンテンツ自動化がAIワークフローの異なる側面を示します。",
            "en": "Covers Claude Code-based automation, with web automation and content automation showing different aspects of AI workflows."
          },
          "type": "similar-topic"
        }
      ],
      "generatedAt": "2025-10-15T15:00:00Z",
      "evaluatedBy": "claude-sonnet-4.5"
    },
    "claude-code-best-practices": {
      "related": [
        {
          "slug": "claude-code-web-automation",
          "score": 0.84,
          "reason": {
            "ko": "베스트 프랙티스를 실전 웹 자동화 사례에 적용하여, 이론적 가이드라인이 구체적 구현으로 연결됩니다.",
            "ja": "ベストプラクティスを実践Web自動化事例に適用し、理論的ガイドラインが具体的実装に繋がります。",
            "en": "Applies best practices to practical web automation cases, connecting theoretical guidelines to concrete implementations."
          },
          "type": "next-step"
        },
        {
          "slug": "llm-blog-automation",
          "score": 0.81,
          "reason": {
            "ko": "Claude Code 활용의 기초와 실전을 다루며, 베스트 프랙티스가 블로그 자동화로 구체화됩니다.",
            "ja": "Claude Code活用の基礎と実践を扱い、ベストプラクティスがブログ自動化で具体化されます。",
            "en": "Covers Claude Code fundamentals and practice, with best practices being concretized in blog automation."
          },
          "type": "next-step"
        },
        {
          "slug": "ai-presentation-automation",
          "score": 0.78,
          "reason": {
            "ko": "Claude Code의 실전 활용 사례를 다루며, 워크플로우 최적화가 프레젠테이션 자동화에 적용됩니다.",
            "ja": "Claude Codeの実践活用事例を扱い、ワークフロー最適化がプレゼンテーション自動化に適用されます。",
            "en": "Covers practical Claude Code use cases, applying workflow optimization to presentation automation."
          },
          "type": "next-step"
        },
        {
          "slug": "google-analytics-mcp-automation",
          "score": 0.72,
          "reason": {
            "ko": "Claude Code와 MCP 통합의 베스트 프랙티스를 다루며, AI 에이전트 활용이 데이터 분석으로 확장됩니다.",
            "ja": "Claude CodeとMCP統合のベストプラクティスを扱い、AIエージェント活用がデータ分析へ拡張されます。",
            "en": "Covers best practices for Claude Code and MCP integration, with AI agent utilization extending to data analysis."
          },
          "type": "next-step"
        },
        {
          "slug": "specification-driven-development",
          "score": 0.71,
          "reason": {
            "ko": "AI 코딩 시대의 개발 방법론을 다루며, Claude Code 베스트 프랙티스가 SDD의 실천 도구가 됩니다.",
            "ja": "AIコーディング時代の開発方法論を扱い、Claude CodeベストプラクティスがSDDの実践ツールとなります。",
            "en": "Covers development methodology for the AI coding era, with Claude Code best practices becoming practical tools for SDD."
          },
          "type": "complementary"
        }
      ],
      "generatedAt": "2025-10-15T15:00:00Z",
      "evaluatedBy": "claude-sonnet-4.5"
    },
    "llm-blog-automation": {
      "related": [
        {
          "slug": "ai-presentation-automation",
          "score": 0.86,
          "reason": {
            "ko": "LLM을 활용한 콘텐츠 자동 생성을 다루며, 블로그 포스트와 프레젠테이션이라는 서로 다른 포맷에 동일한 자동화 원칙을 적용합니다.",
            "ja": "LLMを活用したコンテンツ自動生成を扱い、ブログ投稿とプレゼンテーションという異なるフォーマットに同じ自動化原則を適用します。",
            "en": "Covers LLM-based automated content generation, applying the same automation principles to different formats: blog posts and presentations."
          },
          "type": "similar-topic"
        },
        {
          "slug": "ai-content-recommendation-system",
          "score": 0.83,
          "reason": {
            "ko": "블로그 자동화의 두 핵심 요소인 콘텐츠 생성과 추천을 다루며, LLM 활용이 전체 블로그 시스템을 완성합니다.",
            "ja": "ブログ自動化の二つの核心要素であるコンテンツ生成と推薦を扱い、LLM活用が全体ブログシステムを完成させます。",
            "en": "Covers two core elements of blog automation - content generation and recommendation - with LLM utilization completing the entire blog system."
          },
          "type": "complementary"
        },
        {
          "slug": "claude-code-best-practices",
          "score": 0.81,
          "reason": {
            "ko": "Claude Code 베스트 프랙티스가 블로그 자동화라는 실전 프로젝트로 구현되어, 이론이 실천으로 연결됩니다.",
            "ja": "Claude Codeベストプラクティスがブログ自動化という実践プロジェクトで実装され、理論が実践に繋がります。",
            "en": "Claude Code best practices are implemented in the practical project of blog automation, connecting theory to practice."
          },
          "type": "prerequisite"
        },
        {
          "slug": "google-analytics-mcp-automation",
          "score": 0.74,
          "reason": {
            "ko": "블로그 운영의 콘텐츠 생성과 분석이라는 양대 축을 다루며, 자동화 파이프라인을 완성합니다.",
            "ja": "ブログ運営のコンテンツ生成と分析という両軸を扱い、自動化パイプラインを完成させます。",
            "en": "Covers the two pillars of blog operations - content generation and analysis - completing the automation pipeline."
          },
          "type": "complementary"
        },
        {
          "slug": "astro-scheduled-publishing",
          "score": 0.72,
          "reason": {
            "ko": "블로그 자동화의 실전 구현을 다루며, 콘텐츠 생성 후 예약 발행으로 워크플로우가 완성됩니다.",
            "ja": "ブログ自動化の実践実装を扱い、コンテンツ生成後の予約投稿でワークフローが完成します。",
            "en": "Covers practical blog automation implementation, with scheduled publishing completing the workflow after content generation."
          },
          "type": "complementary"
        }
      ],
      "generatedAt": "2025-10-15T15:00:00Z",
      "evaluatedBy": "claude-sonnet-4.5"
    },
    "google-analytics-mcp-automation": {
      "related": [
        {
          "slug": "ai-agent-notion-mcp-automation",
          "score": 0.87,
          "reason": {
            "ko": "두 글 모두 MCP 서버를 활용한 데이터 통합과 자동화를 다루며, Analytics와 Notion의 서로 다른 데이터 소스를 AI로 연결합니다.",
            "ja": "両記事ともMCPサーバーを活用したデータ統合と自動化を扱い、AnalyticsとNotionの異なるデータソースをAIで接続します。",
            "en": "Both posts cover data integration and automation using MCP servers, connecting different data sources from Analytics and Notion with AI."
          },
          "type": "similar-topic"
        },
        {
          "slug": "blog-launch-analysis-report",
          "score": 0.82,
          "reason": {
            "ko": "GA4 MCP 자동화의 이론과 실전을 다루며, 자동화 시스템이 실제 블로그 분석 리포트로 구현됩니다.",
            "ja": "GA4 MCP自動化の理論と実践を扱い、自動化システムが実際のブログ分析レポートで実装されます。",
            "en": "Covers theory and practice of GA4 MCP automation, with the automation system being implemented in actual blog analysis reports."
          },
          "type": "series"
        },
        {
          "slug": "chrome-devtools-mcp-performance",
          "score": 0.76,
          "reason": {
            "ko": "웹 성능 측정과 데이터 분석을 다루며, DevTools 측정 후 Analytics 분석으로 최적화 파이프라인을 완성합니다.",
            "ja": "Webパフォーマンス測定とデータ分析を扱い、DevTools測定後のAnalytics分析で最適化パイプラインを完成させます。",
            "en": "Covers web performance measurement and data analysis, completing the optimization pipeline from DevTools measurement to Analytics analysis."
          },
          "type": "complementary"
        },
        {
          "slug": "llm-blog-automation",
          "score": 0.74,
          "reason": {
            "ko": "블로그 자동화의 콘텐츠 생성과 성과 분석을 다루며, 생성에서 측정까지 전체 사이클을 완성합니다.",
            "ja": "ブログ自動化のコンテンツ生成と成果分析を扱い、生成から測定まで全体サイクルを完成させます。",
            "en": "Covers blog automation's content generation and performance analysis, completing the full cycle from creation to measurement."
          },
          "type": "complementary"
        },
        {
          "slug": "claude-code-web-automation",
          "score": 0.73,
          "reason": {
            "ko": "Claude Code와 MCP의 실전 활용을 다루며, 브라우저 자동화와 데이터 분석이라는 서로 다른 자동화 영역을 보여줍니다.",
            "ja": "Claude CodeとMCPの実践活用を扱い、ブラウザ自動化とデータ分析という異なる自動化領域を示します。",
            "en": "Covers practical use of Claude Code and MCP, showing different automation domains: browser automation and data analysis."
          },
          "type": "similar-topic"
        }
      ],
      "generatedAt": "2025-10-15T15:00:00Z",
      "evaluatedBy": "claude-sonnet-4.5"
    },
    "blog-launch-analysis-report": {
      "related": [
        {
          "slug": "google-analytics-mcp-automation",
          "score": 0.82,
          "reason": {
            "ko": "GA4 MCP 자동화 시스템의 이론과 실전 적용을 다루며, 자동화 도구가 실제 블로그 분석으로 구현됩니다.",
            "ja": "GA4 MCP自動化システムの理論と実践適用を扱い、自動化ツールが実際のブログ分析で実装されます。",
            "en": "Covers theory and practical application of GA4 MCP automation system, with automation tools being implemented in actual blog analysis."
          },
          "type": "prerequisite"
        },
        {
          "slug": "weekly-analytics-2025-10-14",
          "score": 0.79,
          "reason": {
            "ko": "블로그 분석 리포트의 런칭 분석과 주간 분석을 다루며, 시간대별 성과 추적 사례를 보여줍니다.",
            "ja": "ブログ分析レポートのローンチ分析と週次分析を扱い、時系列の成果追跡事例を示します。",
            "en": "Covers blog analysis reports for launch and weekly periods, showing time-series performance tracking cases."
          },
          "type": "series"
        },
        {
          "slug": "astro-scheduled-publishing",
          "score": 0.76,
          "reason": {
            "ko": "Astro 블로그 운영의 실전 기법을 다루며, 자동 발행과 성과 분석이 블로그 시스템을 완성합니다.",
            "ja": "Astroブログ運営の実践技法を扱い、自動投稿と成果分析がブログシステムを完成させます。",
            "en": "Covers practical Astro blog operation techniques, with automated publishing and performance analysis completing the blog system."
          },
          "type": "complementary"
        },
        {
          "slug": "llm-blog-automation",
          "score": 0.68,
          "reason": {
            "ko": "블로그 자동화의 콘텐츠 생성과 성과 측정을 다루며, 생성에서 분석까지 전체 워크플로우를 구성합니다.",
            "ja": "ブログ自動化のコンテンツ生成と成果測定を扱い、生成から分析まで全体ワークフローを構成します。",
            "en": "Covers blog automation's content generation and performance measurement, composing the full workflow from creation to analysis."
          },
          "type": "complementary"
        },
        {
          "slug": "chrome-devtools-mcp-performance",
          "score": 0.61,
          "reason": {
            "ko": "웹 성능 측정과 블로그 트래픽 분석을 다루며, 기술적 성능과 비즈니스 성과의 종합적 분석을 제공합니다.",
            "ja": "Webパフォーマンス測定とブログトラフィック分析を扱い、技術的パフォーマンスとビジネス成果の総合的分析を提供します。",
            "en": "Covers web performance measurement and blog traffic analysis, providing comprehensive analysis of technical performance and business outcomes."
          },
          "type": "complementary"
        }
      ],
      "generatedAt": "2025-10-15T15:00:00Z",
      "evaluatedBy": "claude-sonnet-4.5"
    },
    "weekly-analytics-2025-10-14": {
      "related": [
        {
          "slug": "blog-launch-analysis-report",
          "score": 0.79,
          "reason": {
            "ko": "블로그 런칭 후 첫 주 분석으로, 시간대별 성장 추이와 데이터 기반 인사이트를 연속적으로 제공합니다.",
            "ja": "ブログローンチ後の初週分析として、時系列の成長推移とデータ駆動型インサイトを連続的に提供します。",
            "en": "As the first week analysis after blog launch, provides continuous time-series growth trends and data-driven insights."
          },
          "type": "series"
        },
        {
          "slug": "google-analytics-mcp-automation",
          "score": 0.73,
          "reason": {
            "ko": "GA4 MCP 자동화 시스템이 주간 리포트 생성에 활용되어, 자동화 도구의 실전 성과를 보여줍니다.",
            "ja": "GA4 MCP自動化システムが週次レポート生成に活用され、自動化ツールの実践成果を示します。",
            "en": "GA4 MCP automation system is utilized in weekly report generation, demonstrating practical outcomes of automation tools."
          },
          "type": "prerequisite"
        },
        {
          "slug": "astro-scheduled-publishing",
          "score": 0.58,
          "reason": {
            "ko": "블로그 운영 자동화의 다른 측면을 다루며, 예약 발행과 성과 분석이 블로그 관리 시스템을 완성합니다.",
            "ja": "ブログ運営自動化の別の側面を扱い、予約投稿と成果分析がブログ管理システムを完成させます。",
            "en": "Covers another aspect of blog operation automation, with scheduled publishing and performance analysis completing the blog management system."
          },
          "type": "complementary"
        },
        {
          "slug": "llm-blog-automation",
          "score": 0.54,
          "reason": {
            "ko": "블로그 콘텐츠 생성과 성과 측정을 다루며, 자동화된 워크플로우의 결과를 데이터로 확인합니다.",
            "ja": "ブログコンテンツ生成と成果測定を扱い、自動化されたワークフローの結果をデータで確認します。",
            "en": "Covers blog content generation and performance measurement, verifying automated workflow results with data."
          },
          "type": "complementary"
        },
        {
          "slug": "chrome-devtools-mcp-performance",
          "score": 0.48,
          "reason": {
            "ko": "웹 성능과 사용자 경험 측정을 다루며, 트래픽 분석과 함께 블로그 품질을 종합적으로 평가합니다.",
            "ja": "Webパフォーマンスとユーザー体験測定を扱い、トラフィック分析と共にブログ品質を総合的に評価します。",
            "en": "Covers web performance and user experience measurement, comprehensively evaluating blog quality along with traffic analysis."
          },
          "type": "complementary"
        }
      ],
      "generatedAt": "2025-10-15T15:00:00Z",
      "evaluatedBy": "claude-sonnet-4.5"
    },
    "ai-agent-persona-analysis": {
      "related": [
        {
          "slug": "ai-agent-collaboration-patterns",
          "score": 0.76,
          "reason": {
            "ko": "AI 에이전트 시스템 설계를 다루며, 페르소나 설정이 협업 패턴과 에이전트 행동에 미치는 영향을 분석합니다.",
            "ja": "AIエージェントシステム設計を扱い、ペルソナ設定が協働パターンとエージェント行動に与える影響を分析します。",
            "en": "Covers AI agent system design, analyzing how persona settings affect collaboration patterns and agent behavior."
          },
          "type": "complementary"
        },
        {
          "slug": "specification-driven-development",
          "score": 0.62,
          "reason": {
            "ko": "AI 에이전트 설계의 실험적 접근과 방법론적 접근을 다루며, 페르소나가 명세 작성에 어떤 영향을 주는지 탐구합니다.",
            "ja": "AIエージェント設計の実験的アプローチと方法論的アプローチを扱い、ペルソナが仕様作成にどう影響するかを探究します。",
            "en": "Covers experimental and methodological approaches to AI agent design, exploring how personas influence specification writing."
          },
          "type": "complementary"
        },
        {
          "slug": "claude-code-best-practices",
          "score": 0.58,
          "reason": {
            "ko": "AI 에이전트 활용의 기본 원칙과 고급 실험을 다루며, 베스트 프랙티스에서 페르소나 최적화로 발전합니다.",
            "ja": "AIエージェント活用の基本原則と高度な実験を扱い、ベストプラクティスからペルソナ最適化へ発展します。",
            "en": "Covers basic principles and advanced experiments in AI agent utilization, evolving from best practices to persona optimization."
          },
          "type": "next-step"
        },
        {
          "slug": "self-healing-ai-systems",
          "score": 0.54,
          "reason": {
            "ko": "AI 시스템의 행동 패턴과 의사결정을 다루며, 페르소나가 시스템 안정성에 미치는 영향을 간접적으로 연결합니다.",
            "ja": "AIシステムの行動パターンと意思決定を扱い、ペルソナがシステム安定性に与える影響を間接的に繋げます。",
            "en": "Covers AI system behavior patterns and decision-making, indirectly connecting how personas affect system stability."
          },
          "type": "complementary"
        },
        {
          "slug": "llm-blog-automation",
          "score": 0.51,
          "reason": {
            "ko": "LLM 기반 콘텐츠 생성을 다루며, AI 페르소나가 생성되는 콘텐츠의 톤과 스타일에 어떤 영향을 주는지 보여줍니다.",
            "ja": "LLM基盤コンテンツ生成を扱い、AIペルソナが生成されるコンテンツのトーンとスタイルにどう影響するかを示します。",
            "en": "Covers LLM-based content generation, showing how AI personas influence the tone and style of generated content."
          },
          "type": "complementary"
        }
      ],
      "generatedAt": "2025-10-15T15:00:00Z",
      "evaluatedBy": "claude-sonnet-4.5"
    },
    "openai-agentkit-tutorial-part2": {
      "related": [
        {
          "slug": "openai-agentkit-tutorial-part1",
          "score": 0.98,
          "reason": {
            "ko": "OpenAI AgentKit 튜토리얼 시리즈로, 1부의 기초 개념 위에 2부의 고급 패턴과 실전 배포를 다룹니다.",
            "ja": "OpenAI AgentKitチュートリアルシリーズとして、1部の基礎概念の上に2部の高度なパターンと実践デプロイを扱います。",
            "en": "As an OpenAI AgentKit tutorial series, covers advanced patterns and production deployment in Part 2 built upon Part 1's foundational concepts."
          },
          "type": "series"
        },
        {
          "slug": "ai-agent-collaboration-patterns",
          "score": 0.73,
          "reason": {
            "ko": "고급 AI 에이전트 패턴을 다루며, AgentKit의 실전 활용이 멀티 에이전트 협업으로 확장됩니다.",
            "ja": "高度なAIエージェントパターンを扱い、AgentKitの実践活用がマルチエージェント協働へ拡張されます。",
            "en": "Covers advanced AI agent patterns, with practical AgentKit usage extending to multi-agent collaboration."
          },
          "type": "complementary"
        },
        {
          "slug": "specification-driven-development",
          "score": 0.68,
          "reason": {
            "ko": "AI 에이전트의 체계적 개발 방법론을 다루며, AgentKit 구현이 SDD 원칙과 결합됩니다.",
            "ja": "AIエージェントの体系的開発方法論を扱い、AgentKit実装がSDD原則と結合されます。",
            "en": "Covers systematic AI agent development methodology, combining AgentKit implementation with SDD principles."
          },
          "type": "complementary"
        },
        {
          "slug": "self-healing-ai-systems",
          "score": 0.64,
          "reason": {
            "ko": "프로덕션 AI 시스템의 안정성을 다루며, AgentKit 배포 후 자가 치유 메커니즘으로 시스템을 강화합니다.",
            "ja": "プロダクションAIシステムの安定性を扱い、AgentKitデプロイ後の自己修復メカニズムでシステムを強化します。",
            "en": "Covers production AI system stability, strengthening systems with self-healing mechanisms after AgentKit deployment."
          },
          "type": "next-step"
        },
        {
          "slug": "claude-code-best-practices",
          "score": 0.59,
          "reason": {
            "ko": "AI 개발 도구의 베스트 프랙티스를 다루며, Claude Code와 OpenAI AgentKit의 상호 보완적 활용을 보여줍니다.",
            "ja": "AI開発ツールのベストプラクティスを扱い、Claude CodeとOpenAI AgentKitの相互補完的活用を示します。",
            "en": "Covers best practices for AI development tools, showing complementary use of Claude Code and OpenAI AgentKit."
          },
          "type": "similar-topic"
        }
      ],
      "generatedAt": "2025-10-15T15:00:00Z",
      "evaluatedBy": "claude-sonnet-4.5"
    },
    "openai-agentkit-tutorial-part1": {
      "related": [
        {
          "slug": "claude-code-best-practices",
          "score": 0.71,
          "reason": {
            "ko": "AI 개발 도구의 기초를 다루며, Claude Code와 OpenAI AgentKit이 상호 보완적인 에이전트 개발 환경을 제공합니다.",
            "ja": "AI開発ツールの基礎を扱い、Claude CodeとOpenAI AgentKitが相互補完的なエージェント開発環境を提供します。",
            "en": "Covers AI development tool fundamentals, with Claude Code and OpenAI AgentKit providing complementary agent development environments."
          },
          "type": "similar-topic"
        },
        {
          "slug": "specification-driven-development",
          "score": 0.64,
          "reason": {
            "ko": "AI 에이전트 개발의 방법론적 기초를 다루며, AgentKit 학습이 SDD 실천으로 연결됩니다.",
            "ja": "AIエージェント開発の方法論的基礎を扱い、AgentKit学習がSDD実践に繋がります。",
            "en": "Covers methodological foundations of AI agent development, with AgentKit learning connecting to SDD practice."
          },
          "type": "complementary"
        },
        {
          "slug": "ai-presentation-automation",
          "score": 0.58,
          "reason": {
            "ko": "AI 자동화 도구의 실전 활용을 다루며, AgentKit 기초 학습 후 구체적 자동화 프로젝트로 발전합니다.",
            "ja": "AI自動化ツールの実践活用を扱い、AgentKit基礎学習後の具体的自動化プロジェクトへ発展します。",
            "en": "Covers practical AI automation tool usage, advancing to concrete automation projects after AgentKit fundamentals."
          },
          "type": "next-step"
        },
        {
          "slug": "llm-blog-automation",
          "score": 0.56,
          "reason": {
            "ko": "LLM 기반 자동화를 다루며, AgentKit과 Claude의 서로 다른 LLM 활용 접근법을 비교합니다.",
            "ja": "LLM基盤自動化を扱い、AgentKitとClaudeの異なるLLM活用アプローチを比較します。",
            "en": "Covers LLM-based automation, comparing different LLM utilization approaches between AgentKit and Claude."
          },
          "type": "similar-topic"
        },
        {
          "slug": "ai-agent-notion-mcp-automation",
          "score": 0.53,
          "reason": {
            "ko": "AI 에이전트의 실전 활용 사례를 다루며, AgentKit 기초 위에 구체적인 자동화 프로젝트를 구축합니다.",
            "ja": "AIエージェントの実践活用事例を扱い、AgentKit基礎の上に具体的な自動化プロジェクトを構築します。",
            "en": "Covers practical AI agent use cases, building concrete automation projects on top of AgentKit fundamentals."
          },
          "type": "next-step"
        }
      ],
      "generatedAt": "2025-10-15T15:00:00Z",
      "evaluatedBy": "claude-sonnet-4.5"
    },
    "claude-skills-implementation-guide": {
      "related": [
        {
          "slug": "claude-code-best-practices",
          "score": 0.88,
          "reason": {
            "ko": "Claude Code의 핵심 기능과 베스트 프랙티스를 다루며, Agent Skills는 이러한 실무 패턴을 구조화하는 발전된 방식입니다.",
            "ja": "Claude Codeの核心機能とベストプラクティスを扱い、Agent Skillsはこれらの実務パターンを構造化する進化した方法です。",
            "en": "Covers Claude Code core features and best practices, with Agent Skills being an evolved way to structure these practical patterns."
          },
          "type": "prerequisite"
        },
        {
          "slug": "llm-blog-automation",
          "score": 0.85,
          "reason": {
            "ko": "11개 전문 에이전트로 블로그 자동화를 구축한 사례로, Skills 도입 전 서브에이전트 방식의 한계와 개선 필요성을 보여줍니다.",
            "ja": "11個の専門エージェントでブログ自動化を構築した事例で、Skills導入前のサブエージェント方式の限界と改善の必要性を示します。",
            "en": "Demonstrates blog automation with 11 specialized agents, showing the limitations of pre-Skills subagent approach and need for improvement."
          },
          "type": "prerequisite"
        },
        {
          "slug": "ai-agent-collaboration-patterns",
          "score": 0.82,
          "reason": {
            "ko": "멀티 에이전트 시스템의 오케스트레이션 패턴을 다루며, Skills는 이러한 협업 패턴을 모듈화하고 재사용 가능하게 만듭니다.",
            "ja": "マルチエージェントシステムのオーケストレーションパターンを扱い、Skillsはこれらの協業パターンをモジュール化して再利用可能にします。",
            "en": "Covers multi-agent orchestration patterns, with Skills modularizing and making these collaboration patterns reusable."
          },
          "type": "related-concept"
        },
        {
          "slug": "specification-driven-development",
          "score": 0.76,
          "reason": {
            "ko": "Markdown 기반 사양 주도 개발을 다루며, SKILL.md 작성법과 유사한 구조화된 문서 접근 방식을 보여줍니다.",
            "ja": "Markdownベースの仕様駆動開発を扱い、SKILL.md作成法と類似した構造化されたドキュメントアプローチを示します。",
            "en": "Covers Markdown-based spec-driven development, showing a structured documentation approach similar to SKILL.md authoring."
          },
          "type": "related-concept"
        },
        {
          "slug": "self-healing-ai-systems",
          "score": 0.71,
          "reason": {
            "ko": "자가 치유 AI 시스템의 구현을 다루며, Skills의 코드 실행 기능과 시스템 자동화 역량을 실전에 적용하는 예시입니다.",
            "ja": "自己修復AIシステムの実装を扱い、Skillsのコード実行機能とシステム自動化能力を実践に適用する例です。",
            "en": "Covers self-healing AI system implementation, demonstrating practical application of Skills code execution and system automation capabilities."
          },
          "type": "next-step"
        }
      ],
      "generatedAt": "2025-10-19T10:05:30.756Z",
      "evaluatedBy": "claude-sonnet-4.5"
    },
    "llm-consumer-research-ssr": {
      "related": [
        {
          "slug": "ai-content-recommendation-system",
          "score": 0.72,
          "reason": {
            "ko": "두 글 모두 LLM 기반 의미론적 분석을 활용합니다. SSR은 텍스트 임베딩으로 소비자 의도를 파악하고, 콘텐츠 추천 시스템은 블로그 포스트 유사도를 계산합니다. 임베딩 벡터와 코사인 유사도라는 동일한 핵심 기술을 사용합니다.",
            "ja": "両記事ともLLMベースの意味論的分析を活用しています。SSRはテキスト埋め込みで消費者意図を把握し、コンテンツ推薦システムはブログポストの類似度を計算します。埋め込みベクトルとコサイン類似度という同じコア技術を使用します。",
            "en": "Both posts leverage LLM-based semantic analysis. SSR uses text embeddings to understand consumer intent, while the content recommendation system calculates blog post similarity. They share core techniques: embedding vectors and cosine similarity."
          },
          "type": "similar-technique"
        },
        {
          "slug": "openai-agentkit-tutorial-part2",
          "score": 0.65,
          "reason": {
            "ko": "SSR 방법론의 엔터프라이즈 적용을 고려한다면 AgentKit의 프로덕션 배포 패턴이 유용합니다. 멀티 에이전트 시스템으로 합성 소비자 생성, 임베딩 계산, 결과 분석을 분업화할 수 있으며, Evals를 통한 품질 모니터링이 가능합니다.",
            "ja": "SSR手法のエンタープライズ適用を検討する場合、AgentKitのプロダクション配備パターンが有用です。マルチエージェントシステムで合成消費者生成、埋め込み計算、結果分析を分業化でき、Evalsによる品質モニタリングが可能です。",
            "en": "For enterprise SSR implementation, AgentKit's production deployment patterns are valuable. Multi-agent systems can distribute synthetic consumer generation, embedding calculation, and analysis, with Evals for quality monitoring."
          },
          "type": "complementary-architecture"
        },
        {
          "slug": "ai-agent-persona-analysis",
          "score": 0.61,
          "reason": {
            "ko": "SSR에서 합성 소비자에 인구통계적 특성을 부여할 때, 이 글의 페르소나 설계 원칙이 중요합니다. 성별 레이블이 편향을 강화할 수 있다는 연구 결과는 SSR 프롬프트 설계 시 전문성 기반 접근을 고려하게 합니다.",
            "ja": "SSRで合成消費者に人口統計的特性を付与する際、この記事のペルソナ設計原則が重要です。性別ラベルがバイアスを強化する可能性があるという研究結果は、SSRプロンプト設計時に専門性ベースのアプローチを考慮させます。",
            "en": "When assigning demographics to synthetic consumers in SSR, persona design principles from this post are crucial. Research showing gender labels amplify bias suggests using expertise-based approaches in SSR prompt design."
          },
          "type": "complementary-concept"
        },
        {
          "slug": "claude-skills-implementation-guide",
          "score": 0.58,
          "reason": {
            "ko": "SSR 시스템을 Claude Skills로 구조화하면 효율적입니다. Consumer Generator, Embedding Calculator, Similarity Analyzer를 개별 스킬로 분리하여 Progressive Disclosure로 토큰을 44% 절감할 수 있습니다.",
            "ja": "SSRシステムをClaude Skillsで構造化すると効率的です。Consumer Generator、Embedding Calculator、Similarity Analyzerを個別スキルに分離してProgressive Disclosureでトークンを44%削減できます。",
            "en": "Structuring SSR systems with Claude Skills is efficient. Separate Consumer Generator, Embedding Calculator, and Similarity Analyzer as individual skills to achieve 44% token reduction via Progressive Disclosure."
          },
          "type": "implementation-tool"
        },
        {
          "slug": "llm-blog-automation",
          "score": 0.53,
          "reason": {
            "ko": "블로그 자동화에서 배운 11개 전문 에이전트 시스템 설계 원칙을 SSR 시스템에도 적용할 수 있습니다. 특히 Web Researcher 에이전트로 최신 소비자 트렌드를 수집하고, Writing Assistant로 설문 문항을 생성하는 워크플로우가 가능합니다.",
            "ja": "ブログ自動化で学んだ11個の専門エージェントシステム設計原則をSSRシステムにも適用できます。特にWeb Researcherエージェントで最新消費者トレンドを収集し、Writing Assistantでアンケート項目を生成するワークフローが可能です。",
            "en": "Design principles from the 11-agent blog automation system apply to SSR. Web Researcher agents can gather consumer trends, while Writing Assistants generate survey items in automated workflows."
          },
          "type": "related-automation"
        }
      ],
      "generatedAt": "2025-10-19T10:30:39.316Z",
      "evaluatedBy": "claude-sonnet-4.5"
    },
    "ssr-survey-analysis": {
      "related": [
        {
          "slug": "llm-consumer-research-ssr",
          "score": 0.92,
          "reason": {
            "ko": "두 글 모두 Semantic Similarity Rating(SSR) 방법론을 핵심으로 다루며, 텍스트 임베딩과 코사인 유사도를 활용한 LLM 기반 평가 시스템을 설명합니다. 동일한 기술 스택(GPT-4, text-embedding-3-small)과 통계적 신뢰도 검증 과정을 공유하며, 전통적 설문 방법론의 한계를 극복하는 혁신적 접근을 제시합니다.",
            "ja": "両記事ともSemantic Similarity Rating（SSR）手法を核心として扱い、テキスト埋め込みとコサイン類似度を活用したLLMベースの評価システムを説明しています。同じ技術スタック（GPT-4、text-embedding-3-small）と統計的信頼性検証プロセスを共有し、従来の調査手法の限界を克服する革新的アプローチを提示しています。",
            "en": "Both posts focus on Semantic Similarity Rating (SSR) methodology, explaining LLM-based evaluation systems using text embeddings and cosine similarity. They share the same tech stack (GPT-4, text-embedding-3-small) and statistical reliability validation processes, presenting innovative approaches to overcome traditional survey limitations."
          },
          "type": "series"
        },
        {
          "slug": "claude-skills-implementation-guide",
          "score": 0.68,
          "reason": {
            "ko": "LLM 기반 시스템의 실전 적용과 최적화에 초점을 맞춥니다. SSR 분석의 자동화 워크플로우 구축에 필요한 Agent Skills 아키텍처와 토큰 최적화 기법(44% 절감)을 제공하며, 대규모 평가 작업의 효율성을 높이는 실무 노하우를 다룹니다.",
            "ja": "LLMベースシステムの実践適用と最適化に焦点を当てています。SSR分析の自動化ワークフロー構築に必要なAgent Skillsアーキテクチャとトークン最適化技法（44%削減）を提供し、大規模評価作業の効率性を高める実務ノウハウを扱っています。",
            "en": "Focuses on practical application and optimization of LLM-based systems. Provides Agent Skills architecture and token optimization techniques (44% reduction) needed for building automated SSR analysis workflows, covering practical know-how for improving efficiency in large-scale evaluation tasks."
          },
          "type": "related"
        },
        {
          "slug": "openai-agentkit-tutorial-part2",
          "score": 0.64,
          "reason": {
            "ko": "LLM 기반 자동화 시스템의 프로덕션 배포와 고급 패턴을 다룹니다. 225개 평가를 수행하는 SSR 시스템 구축 시 필요한 에러 핸들링, 성능 최적화, 복잡한 워크플로우 구성 방법을 제공하며, AI/ML 카테고리에서 동일하게 0.9점의 높은 점수를 받았습니다.",
            "ja": "LLMベースの自動化システムのプロダクション展開と高度なパターンを扱います。225個の評価を実行するSSRシステム構築時に必要なエラーハンドリング、パフォーマンス最適化、複雑なワークフロー構成方法を提供し、AI/MLカテゴリで同じく0.9点の高スコアを獲得しています。",
            "en": "Covers production deployment and advanced patterns for LLM-based automation systems. Provides error handling, performance optimization, and complex workflow configuration methods needed for building SSR systems that perform 225 evaluations, with the same high AI/ML category score of 0.9."
          },
          "type": "related"
        },
        {
          "slug": "ai-agent-persona-analysis",
          "score": 0.58,
          "reason": {
            "ko": "AI 페르소나 설정이 평가 품질에 미치는 영향을 실험적으로 분석합니다. SSR 방법론에서 15개 페르소나를 생성하고 활용하는 과정과 직접적으로 연결되며, LLM 기반 평가 시스템의 페르소나 디자인 원칙을 제공합니다.",
            "ja": "AIペルソナ設定が評価品質に与える影響を実験的に分析しています。SSR手法で15個のペルソナを生成・活用するプロセスと直接的に関連し、LLMベース評価システムのペルソナデザイン原則を提供しています。",
            "en": "Experimentally analyzes how AI persona settings impact evaluation quality. Directly connects with the process of creating and utilizing 15 personas in SSR methodology, providing persona design principles for LLM-based evaluation systems."
          },
          "type": "prerequisite"
        },
        {
          "slug": "google-analytics-mcp-automation",
          "score": 0.52,
          "reason": {
            "ko": "데이터 수집과 자동화 분석 시스템 구축의 실전 사례를 제공합니다. SSR 실험 결과의 통계적 분석과 리포트 자동 생성에 활용할 수 있는 MCP 기반 워크플로우와 실시간 데이터 처리 기법을 다루며, Automation 카테고리에서 높은 점수(0.95)를 받았습니다.",
            "ja": "データ収集と自動化分析システム構築の実践事例を提供しています。SSR実験結果の統計的分析とレポート自動生成に活用できるMCPベースのワークフローとリアルタイムデータ処理技法を扱い、Automationカテゴリで高スコア（0.95）を獲得しています。",
            "en": "Provides practical cases of building data collection and automated analysis systems. Covers MCP-based workflows and real-time data processing techniques that can be used for statistical analysis of SSR experiment results and automated report generation, with a high Automation category score (0.95)."
          },
          "type": "next_step"
        }
      ],
      "generatedAt": "2025-10-19T13:50:00.000Z",
      "evaluatedBy": "claude-sonnet-4.5"
    },
    "playwright-ai-testing": {
      "related": [
        {
          "slug": "claude-code-web-automation",
          "score": 0.92,
          "reason": {
            "ko": "Playwright MCP와 Chrome DevTools를 활용한 웹 자동화의 핵심 개념을 다루는 필수 선행 학습 콘텐츠입니다. 브라우저 제어, 성능 측정, UI 인터랙션의 기초를 이해하면 AI 기반 E2E 테스트 작성에 더 깊이 있게 접근할 수 있습니다.",
            "ja": "Playwright MCPとChrome DevToolsを活用したウェブ自動化の核心概念を扱う必須の事前学習コンテンツです。ブラウザ制御、パフォーマンス測定、UIインタラクションの基礎を理解すれば、AI基盤のE2Eテスト作成により深くアプローチできます。",
            "en": "Essential prerequisite content covering core concepts of web automation with Playwright MCP and Chrome DevTools. Understanding browser control, performance measurement, and UI interaction fundamentals enables deeper engagement with AI-powered E2E test creation."
          },
          "type": "prerequisite"
        },
        {
          "slug": "astro-scheduled-publishing",
          "score": 0.85,
          "reason": {
            "ko": "GitHub Actions를 활용한 CI/CD 자동화의 실전 사례를 제공합니다. Playwright 테스트를 GitHub Actions에 통합할 때 필요한 워크플로우 설정, 자동 실행, 스케줄링 개념을 미리 익힐 수 있습니다.",
            "ja": "GitHub Actionsを活用したCI/CD自動化の実践事例を提供します。PlaywrightテストをGitHub Actionsに統合する際に必要なワークフロー設定、自動実行、スケジューリング概念を事前に習得できます。",
            "en": "Provides practical CI/CD automation examples using GitHub Actions. Learn workflow configuration, automatic execution, and scheduling concepts needed for integrating Playwright tests with GitHub Actions."
          },
          "type": "complementary"
        },
        {
          "slug": "chrome-devtools-mcp-performance",
          "score": 0.84,
          "reason": {
            "ko": "Chrome DevTools MCP를 통한 성능 측정 자동화를 다룹니다. Playwright 테스트에서 Core Web Vitals, Lighthouse 스코어를 측정하고 성능 회귀를 감지하는 고급 테스트 전략으로 확장할 수 있습니다.",
            "ja": "Chrome DevTools MCPを通じたパフォーマンス測定自動化を扱います。PlaywrightテストでCore Web Vitals、Lighthouseスコアを測定し、パフォーマンスリグレッションを検出する高度なテスト戦略に拡張できます。",
            "en": "Covers performance measurement automation via Chrome DevTools MCP. Expand Playwright tests to advanced strategies measuring Core Web Vitals, Lighthouse scores, and detecting performance regressions."
          },
          "type": "next-step"
        }
      ],
      "generatedAt": "2025-10-21T13:37:44.886Z",
      "evaluatedBy": "claude-sonnet-4.5"
    },
    "langgraph-multi-agent": {
      "related": [
        {
          "slug": "ai-agent-collaboration-patterns",
          "score": 0.94,
          "reason": {
            "ko": "두 글 모두 멀티 에이전트 시스템의 협업 패턴, 오케스트레이션, 아키텍처 설계를 다루며, LangGraph의 실전 구현과 이론적 설계 패턴이 상호 보완적입니다.",
            "ja": "両記事ともマルチエージェントシステムの協働パターン、オーケストレーション、アーキテクチャ設計を扱い、LangGraphの実践的実装と理論的設計パターンが相互補完的です。",
            "en": "Both posts cover multi-agent system collaboration patterns, orchestration, and architectural design, with LangGraph's practical implementation complementing theoretical design patterns."
          },
          "type": "prerequisite",
          "dimensions": {
            "topic": 0.98,
            "techStack": 0.85,
            "category": 0.95,
            "difficulty": 0.9,
            "complementary": 0.95
          }
        },
        {
          "slug": "self-healing-ai-systems",
          "score": 0.86,
          "reason": {
            "ko": "LangGraph의 체크포인팅과 상태 관리 메커니즘이 자가 치유 시스템의 오류 복구 전략과 직접적으로 연결되며, 프로덕션 환경의 탄력적 AI 시스템 구축에 필수적인 내용입니다.",
            "ja": "LangGraphのチェックポイントと状態管理メカニズムが自己修復システムのエラー回復戦略と直接的に結びつき、本番環境の弾力的なAIシステム構築に不可欠な内容です。",
            "en": "LangGraph's checkpointing and state management mechanisms directly connect to self-healing system error recovery strategies, essential for building resilient AI systems in production."
          },
          "type": "next-step",
          "dimensions": {
            "topic": 0.82,
            "techStack": 0.8,
            "category": 0.95,
            "difficulty": 0.9,
            "complementary": 0.92
          }
        },
        {
          "slug": "specification-driven-development",
          "score": 0.78,
          "reason": {
            "ko": "LangGraph 멀티 에이전트 시스템 구축 시 스펙 주도 개발 방법론을 적용하면 에이전트 간 인터페이스와 워크플로우를 명확히 정의할 수 있으며, AI 시대의 아키텍처 설계 패러다임을 공유합니다.",
            "ja": "LangGraphマルチエージェントシステム構築時に仕様駆動開発手法を適用すると、エージェント間のインターフェースとワークフローを明確に定義でき、AI時代のアーキテクチャ設計パラダイムを共有します。",
            "en": "Applying specification-driven development methodology when building LangGraph multi-agent systems enables clear definition of inter-agent interfaces and workflows, sharing the architectural design paradigm of the AI era."
          },
          "type": "complementary",
          "dimensions": {
            "topic": 0.72,
            "techStack": 0.75,
            "category": 0.88,
            "difficulty": 0.9,
            "complementary": 0.85
          }
        },
        {
          "slug": "openai-agentkit-tutorial-part2",
          "score": 0.74,
          "reason": {
            "ko": "OpenAI AgentKit과 LangGraph는 멀티 에이전트 시스템 구축의 대안적 프레임워크로, 워크플로우 구성, 에러 핸들링, 프로덕션 배포 전략에서 공통 패턴과 차별점을 비교할 수 있습니다.",
            "ja": "OpenAI AgentKitとLangGraphはマルチエージェントシステム構築の代替的フレームワークとして、ワークフロー構成、エラーハンドリング、本番デプロイ戦略で共通パターンと差別点を比較できます。",
            "en": "OpenAI AgentKit and LangGraph serve as alternative frameworks for building multi-agent systems, enabling comparison of common patterns and differences in workflow composition, error handling, and production deployment strategies."
          },
          "type": "similar-topic",
          "dimensions": {
            "topic": 0.85,
            "techStack": 0.7,
            "category": 0.82,
            "difficulty": 0.9,
            "complementary": 0.68
          }
        },
        {
          "slug": "metadata-based-recommendation-optimization",
          "score": 0.68,
          "reason": {
            "ko": "LangGraph의 상태 관리와 메타데이터 기반 최적화는 멀티 에이전트 시스템의 성능 개선과 비용 절감에 직접 적용 가능하며, 효율적인 캐싱 전략과 인덱싱 기법을 공유합니다.",
            "ja": "LangGraphの状態管理とメタデータベースの最適化は、マルチエージェントシステムのパフォーマンス改善とコスト削減に直接適用可能で、効率的なキャッシング戦略とインデックス技法を共有します。",
            "en": "LangGraph's state management and metadata-based optimization are directly applicable to performance improvement and cost reduction in multi-agent systems, sharing efficient caching strategies and indexing techniques."
          },
          "type": "complementary",
          "dimensions": {
            "topic": 0.58,
            "techStack": 0.65,
            "category": 0.78,
            "difficulty": 0.9,
            "complementary": 0.75
          }
        }
      ],
      "generatedAt": "2025-10-25T10:29:28.511Z",
      "evaluatedBy": "claude-sonnet-4.5"
    },
    "jules-autocoding": {
      "related": [
        {
          "slug": "claude-code-best-practices",
          "score": 0.89,
          "reason": {
            "ko": "AI 코딩 에이전트의 실전 활용 방법을 다루며, Jules는 Claude Code와 함께 비교 분석할 수 있는 대표적인 자율 코딩 도구입니다.",
            "ja": "AIコーディングエージェントの実践活用方法を扱い、JulesはClaude Codeと共に比較分析できる代表的な自律コーディングツールです。",
            "en": "Covers practical AI coding agent usage, with Jules being a representative autonomous coding tool that can be compared with Claude Code."
          },
          "type": "similar-topic",
          "dimensions": {
            "topic": 0.92,
            "techStack": 0.85,
            "purpose": 0.88,
            "complementary": 0.9
          }
        },
        {
          "slug": "specification-driven-development",
          "score": 0.84,
          "reason": {
            "ko": "AI 에이전트가 명세서를 기반으로 자율적으로 코드를 생성하는 방법론을 다루며, Jules의 GitHub 이슈 해결 워크플로우와 직접 연결됩니다.",
            "ja": "AIエージェントが仕様書を基に自律的にコードを生成する方法論を扱い、JulesのGitHub Issue解決ワークフローと直接繋がります。",
            "en": "Covers AI agent methodology for autonomous code generation from specs, directly connecting to Jules' GitHub issue resolution workflow."
          },
          "type": "prerequisite",
          "dimensions": {
            "topic": 0.88,
            "techStack": 0.75,
            "purpose": 0.82,
            "complementary": 0.85
          }
        },
        {
          "slug": "llm-blog-automation",
          "score": 0.81,
          "reason": {
            "ko": "LLM 기반 자동화 시스템 구축을 다루며, Jules의 Gemini 2.5 Pro 활용과 Claude의 콘텐츠 자동화를 비교할 수 있습니다.",
            "ja": "LLMベースの自動化システム構築を扱い、JulesのGemini 2.5 Pro活用とClaudeのコンテンツ自動化を比較できます。",
            "en": "Covers LLM-based automation systems, allowing comparison between Jules' Gemini 2.5 Pro usage and Claude's content automation."
          },
          "type": "similar-topic",
          "dimensions": {
            "topic": 0.85,
            "techStack": 0.78,
            "purpose": 0.8,
            "complementary": 0.82
          }
        },
        {
          "slug": "ai-agent-collaboration-patterns",
          "score": 0.78,
          "reason": {
            "ko": "멀티 에이전트 시스템과 협업 패턴을 다루며, Jules의 비동기 백그라운드 작업을 더 큰 에이전트 아키텍처로 확장하는 방법을 제시합니다.",
            "ja": "マルチエージェントシステムと協働パターンを扱い、Julesの非同期バックグラウンド作業をより大きなエージェントアーキテクチャに拡張する方法を提示します。",
            "en": "Covers multi-agent systems and collaboration patterns, showing how to scale Jules' async background work into larger agent architectures."
          },
          "type": "next-step",
          "dimensions": {
            "topic": 0.8,
            "techStack": 0.72,
            "purpose": 0.75,
            "complementary": 0.82
          }
        },
        {
          "slug": "astro-scheduled-publishing",
          "score": 0.72,
          "reason": {
            "ko": "GitHub Actions를 활용한 자동화 워크플로우를 다루며, Jules의 GitHub 네이티브 통합과 CI/CD 자동화 패턴이 연결됩니다.",
            "ja": "GitHub Actionsを活用した自動化ワークフローを扱い、JulesのGitHubネイティブ統合とCI/CD自動化パターンが繋がります。",
            "en": "Covers automation workflows using GitHub Actions, connecting with Jules' GitHub native integration and CI/CD automation patterns."
          },
          "type": "complementary",
          "dimensions": {
            "topic": 0.75,
            "techStack": 0.7,
            "purpose": 0.72,
            "complementary": 0.7
          }
        }
      ],
      "generatedAt": "2025-10-25T00:26:21.433Z",
      "evaluatedBy": "claude-sonnet-4.5"
    },
    "bigquery-mcp-prefix-filtering": {
      "related": [
        {
          "slug": "google-analytics-mcp-automation",
          "score": 0.89,
          "reason": {
            "ko": "GA4 MCP 서버 구현과 BigQuery MCP 서버는 동일한 MCP 아키텍처 패턴과 GCP 인증 메커니즘을 공유합니다. 두 포스트 모두 TypeScript/Node.js 기반 MCP 서버 구축, AI 에이전트 통합, 데이터 접근 제어를 다루며, BigQuery의 상위 호환 사례로 GA4 API 통합을 이해할 수 있습니다.",
            "ja": "GA4 MCPサーバーの実装とBigQuery MCPサーバーは、同じMCPアーキテクチャパターンとGCP認証メカニズムを共有します。両記事ともTypeScript/Node.jsベースのMCPサーバー構築、AIエージェント統合、データアクセス制御を扱い、BigQueryの上位互換ケースとしてGA4 API統合を理解できます。",
            "en": "GA4 MCP server implementation shares the same MCP architecture patterns and GCP authentication mechanisms with BigQuery MCP. Both posts cover TypeScript/Node.js-based MCP server construction, AI agent integration, and data access control, with GA4 API integration serving as a complementary use case to BigQuery."
          },
          "type": "similar-topic"
        },
        {
          "slug": "ai-agent-collaboration-patterns",
          "score": 0.82,
          "reason": {
            "ko": "멀티 에이전트 시스템의 아키텍처 설계 원칙이 BigQuery MCP 서버의 접근 제어 메커니즘과 밀접하게 연관됩니다. 에이전트 간 역할 분담, 통신 프로토콜, 보안 설계는 Dataset Prefix 필터링과 같은 데이터 접근 제어 패턴의 기반이 됩니다. 두 포스트 모두 고난이도 시스템 아키텍처를 다룹니다.",
            "ja": "マルチエージェントシステムのアーキテクチャ設計原則は、BigQuery MCPサーバーのアクセス制御メカニズムと密接に関連します。エージェント間の役割分担、通信プロトコル、セキュリティ設計は、Dataset Prefixフィルタリングのようなデータアクセス制御パターンの基盤となります。両記事とも高難易度のシステムアーキテクチャを扱います。",
            "en": "Multi-agent system architecture design principles are closely related to BigQuery MCP server's access control mechanisms. Agent role distribution, communication protocols, and security design form the foundation for data access control patterns like Dataset Prefix filtering. Both posts cover advanced system architecture."
          },
          "type": "complementary"
        },
        {
          "slug": "self-healing-ai-systems",
          "score": 0.78,
          "reason": {
            "ko": "자가 치유 시스템의 오류 감지와 복구 메커니즘은 BigQuery MCP 서버의 안정성 설계에 필수적입니다. API 에러 핸들링, 재시도 로직, 모니터링 전략은 프로덕션 환경의 MCP 서버 운영에 직접 적용할 수 있습니다. 두 포스트 모두 엔터프라이즈급 시스템 설계를 다룹니다.",
            "ja": "自己修復システムのエラー検出と復旧メカニズムは、BigQuery MCPサーバーの安定性設計に不可欠です。APIエラーハンドリング、リトライロジック、モニタリング戦略は、プロダクション環境のMCPサーバー運用に直接適用できます。両記事ともエンタープライズグレードのシステム設計を扱います。",
            "en": "Self-healing system's error detection and recovery mechanisms are essential for BigQuery MCP server's stability design. API error handling, retry logic, and monitoring strategies can be directly applied to production MCP server operations. Both posts cover enterprise-grade system design."
          },
          "type": "next-step"
        },
        {
          "slug": "specification-driven-development",
          "score": 0.75,
          "reason": {
            "ko": "스펙 주도 개발 방법론은 BigQuery MCP 서버의 API 명세와 인터페이스 설계에 적용할 수 있는 체계적 접근법을 제공합니다. TypeScript 타입 시스템을 활용한 타입 안전한 MCP 서버 구현은 SDD의 명세서 기반 개발과 완벽하게 호환됩니다.",
            "ja": "仕様駆動開発方法論は、BigQuery MCPサーバーのAPI仕様とインターフェース設計に適用できる体系的なアプローチを提供します。TypeScript型システムを活用した型安全なMCPサーバー実装は、SDDの仕様書ベース開発と完全に互換性があります。",
            "en": "Specification-driven development methodology provides a systematic approach applicable to BigQuery MCP server's API specification and interface design. Type-safe MCP server implementation using TypeScript type system is perfectly compatible with SDD's specification-based development."
          },
          "type": "prerequisite"
        },
        {
          "slug": "metadata-based-recommendation-optimization",
          "score": 0.72,
          "reason": {
            "ko": "메타데이터 기반 최적화 전략은 BigQuery 쿼리 성능 향상과 비용 절감에 직접 적용할 수 있습니다. Dataset Prefix 필터링을 통한 스캔 범위 축소, 파티션 프루닝, 캐싱 전략은 API 비용 95% 절감 사례와 동일한 최적화 패턴을 따릅니다.",
            "ja": "メタデータベースの最適化戦略は、BigQueryクエリのパフォーマンス向上とコスト削減に直接適用できます。Dataset Prefixフィルタリングによるスキャン範囲の縮小、パーティションプルーニング、キャッシング戦略は、APIコスト95%削減事例と同じ最適化パターンに従います。",
            "en": "Metadata-based optimization strategies can be directly applied to BigQuery query performance improvement and cost reduction. Scan range reduction through Dataset Prefix filtering, partition pruning, and caching strategies follow the same optimization patterns as the 95% API cost reduction case."
          },
          "type": "complementary"
        }
      ],
      "generatedAt": "2025-10-29T04:10:14.561Z",
      "evaluatedBy": "claude-sonnet-4.5"
    },
    "claude-code-hooks-workflow": {
      "related": [
        {
          "slug": "astro-scheduled-publishing",
          "score": 0.82,
          "reason": {
            "ko": "GitHub Actions 기반 CI/CD 자동화를 다루며, Hook 워크플로우와 유사한 자동 빌드/배포 파이프라인을 구축합니다. DevOps 자동화 관점에서 강한 시너지를 보입니다.",
            "ja": "GitHub ActionsベースのCI/CD自動化を扱い、Hookワークフローに類似した自動ビルド/デプロイパイプラインを構築します。DevOps自動化の観点から強いシナジーを示します。",
            "en": "Covers GitHub Actions-based CI/CD automation with automatic build/deploy pipelines similar to Hook workflows. Shows strong synergy from a DevOps automation perspective."
          },
          "type": "complementary"
        },
        {
          "slug": "claude-skills-implementation-guide",
          "score": 0.79,
          "reason": {
            "ko": "Claude Code 에이전트 최적화와 토큰 절감 전략을 다루며, Hook 시스템과 함께 사용하면 더 효율적인 자동화 워크플로우를 구축할 수 있습니다.",
            "ja": "Claude Codeエージェントの最適化とトークン削減戦略を扱い、Hookシステムと組み合わせることでより効率的な自動化ワークフローを構築できます。",
            "en": "Covers Claude Code agent optimization and token reduction strategies. Combined with Hook systems, it enables building more efficient automation workflows."
          },
          "type": "complementary"
        },
        {
          "slug": "playwright-ai-testing",
          "score": 0.77,
          "reason": {
            "ko": "E2E 테스트 자동화와 CI/CD 통합을 다루며, Hook 기반 자동화 리뷰 시스템의 테스트 단계에 적용 가능한 실무 지식을 제공합니다.",
            "ja": "E2Eテスト自動化とCI/CD統合を扱い、Hookベースの自動化レビューシステムのテスト段階に適用可能な実務知識を提供します。",
            "en": "Covers E2E test automation and CI/CD integration, providing practical knowledge applicable to the testing phase of Hook-based automated review systems."
          },
          "type": "next-step"
        },
        {
          "slug": "claude-code-best-practices",
          "score": 0.73,
          "reason": {
            "ko": "Claude Code 워크플로우 기초를 다루는 필수 전제 지식입니다. Hook 시스템을 효과적으로 활용하기 위한 Explore→Plan→Code→Commit 패턴을 제공합니다.",
            "ja": "Claude Codeワークフローの基礎を扱う必須の前提知識です。Hookシステムを効果的に活用するためのExplore→Plan→Code→Commitパターンを提供します。",
            "en": "Covers essential prerequisite knowledge of Claude Code workflow basics. Provides the Explore→Plan→Code→Commit pattern for effectively utilizing Hook systems."
          },
          "type": "prerequisite"
        },
        {
          "slug": "jules-autocoding",
          "score": 0.71,
          "reason": {
            "ko": "자율 AI 코딩 에이전트의 비동기 워크플로우를 다루며, Hook 시스템과 결합하여 더 고도화된 자동화 파이프라인을 구축할 수 있습니다.",
            "ja": "自律AIコーディングエージェントの非同期ワークフローを扱い、Hookシステムと組み合わせてより高度な自動化パイプラインを構築できます。",
            "en": "Covers asynchronous workflows of autonomous AI coding agents. Can be combined with Hook systems to build more sophisticated automation pipelines."
          },
          "type": "similar-topic"
        }
      ],
      "generatedAt": "2025-10-29T04:10:14.562Z",
      "evaluatedBy": "claude-sonnet-4.5"
    },
    "llm-page-migration-standardization": {
      "related": [
        {
          "slug": "claude-code-web-automation",
          "score": 0.82,
          "reason": {
            "ko": "Playwright MCP를 활용한 웹 자동화 테스팅 기법이 페이지 마이그레이션의 테스트 자동화 단계와 직접 연관됩니다. 동일한 Playwright 기술 스택과 높은 자동화 수준을 공유합니다.",
            "ja": "Playwright MCPを活用したWeb自動化テスト技法がページマイグレーションのテスト自動化段階と直接関連します。同じPlaywright技術スタックと高い自動化レベルを共有します。",
            "en": "Web automation testing with Playwright MCP directly relates to the test automation phase of page migration. Shares the same Playwright tech stack and high automation levels."
          },
          "type": "related-stack",
          "dimensions": {
            "topic": 0.75,
            "techStack": 0.9,
            "category": 0.87,
            "difficulty": 1,
            "complementary": 0.75
          }
        },
        {
          "slug": "playwright-ai-testing",
          "score": 0.8,
          "reason": {
            "ko": "Playwright 기반 E2E 테스트 자동화 기법이 웹 컴포넌트 마이그레이션의 종합 테스트 단계에 필수적입니다. AI 기반 코드 생성과 자동화 접근 방식이 유사합니다.",
            "ja": "Playwright基盤E2Eテスト自動化技法がWebコンポーネントマイグレーションの総合テスト段階に必須です。AI基盤コード生成と自動化アプローチが類似しています。",
            "en": "Playwright-based E2E test automation is essential for the comprehensive testing phase of web component migration. Similar AI-based code generation and automation approaches."
          },
          "type": "complementary",
          "dimensions": {
            "topic": 0.7,
            "techStack": 0.85,
            "category": 0.9,
            "difficulty": 0.85,
            "complementary": 0.8
          }
        },
        {
          "slug": "specification-driven-development",
          "score": 0.76,
          "reason": {
            "ko": "스펙 주도 개발 방법론이 LLM 기반 마이그레이션의 명세 작성과 자동 구현 단계에 적용되는 핵심 패러다임입니다. AI 코딩 아키텍처 관점이 일치합니다.",
            "ja": "仕様駆動開発方法論がLLM基盤マイグレーションの仕様書作成と自動実装段階に適用される核心パラダイムです。AIコーディングアーキテクチャの観点が一致します。",
            "en": "Specification-driven development methodology is the core paradigm applied to the specification writing and auto-implementation phases of LLM-based migration. Aligned AI coding architecture perspectives."
          },
          "type": "prerequisite",
          "dimensions": {
            "topic": 0.8,
            "techStack": 0.65,
            "category": 0.85,
            "difficulty": 1,
            "complementary": 0.7
          }
        },
        {
          "slug": "llm-blog-automation",
          "score": 0.73,
          "reason": {
            "ko": "LLM 기반 콘텐츠 자동화 경험이 페이지 마이그레이션의 콘텐츠 변환 단계에 활용됩니다. Claude Code와 Astro 기술 스택을 공유하며 자동화 수준이 유사합니다.",
            "ja": "LLM基盤コンテンツ自動化経験がページマイグレーションのコンテンツ変換段階に活用されます。Claude CodeとAstro技術スタックを共有し、自動化レベルが類似しています。",
            "en": "LLM-based content automation experience is utilized in the content transformation phase of page migration. Shares Claude Code and Astro tech stack with similar automation levels."
          },
          "type": "similar-topic",
          "dimensions": {
            "topic": 0.85,
            "techStack": 0.75,
            "category": 0.82,
            "difficulty": 0.85,
            "complementary": 0.55
          }
        },
        {
          "slug": "claude-code-hooks-workflow",
          "score": 0.71,
          "reason": {
            "ko": "Hook 기반 워크플로우 자동화가 마이그레이션 프로세스의 코드 품질 보장과 CI/CD 통합 단계에 적용됩니다. 높은 자동화와 DevOps 수준을 공유합니다.",
            "ja": "Hookベースワークフロー自動化がマイグレーションプロセスのコード品質保証とCI/CD統合段階に適用されます。高い自動化とDevOpsレベルを共有します。",
            "en": "Hook-based workflow automation applies to the code quality assurance and CI/CD integration phases of the migration process. Shares high automation and DevOps levels."
          },
          "type": "next-step",
          "dimensions": {
            "topic": 0.65,
            "techStack": 0.7,
            "category": 0.87,
            "difficulty": 1,
            "complementary": 0.65
          }
        }
      ],
      "generatedAt": "2025-10-29T08:35:17.416Z",
      "evaluatedBy": "claude-sonnet-4.5"
    },
    "claude-code-parallel-testing": {
      "related": [
        {
          "slug": "llm-page-migration-standardization",
          "score": 0.94,
          "reason": {
            "ko": "동일한 웹페이지 마이그레이션 프로젝트의 선행 포스트로, Playwright 자동화 테스팅과 웹 컴포넌트 아키텍처를 다룹니다. 본 포스트에서 구현한 병렬 테스트 시스템의 배경과 전체 마이그레이션 워크플로우를 이해하는 데 필수적이며, Claude Code + Playwright + axe-core 기술 스택이 완벽히 일치합니다. 종합 테스트 자동화 주제에서 '전체 워크플로우(선행) → 병렬 테스트 최적화(본 포스트)'의 자연스러운 학습 경로를 제공합니다.",
            "ja": "同じウェブページ移行プロジェクトの前編として、Playwright自動テストとWebコンポーネントアーキテクチャを扱います。本記事で実装した並列テストシステムの背景と全体的な移行ワークフローを理解するために必須であり、Claude Code + Playwright + axe-coreの技術スタックが完全に一致します。包括的なテスト自動化というトピックで「全体ワークフロー(前編) → 並列テスト最適化(本記事)」という自然な学習パスを提供します。",
            "en": "As the prerequisite post from the same webpage migration project, it covers Playwright automated testing and web component architecture. Essential for understanding the background and overall migration workflow of the parallel testing system implemented in this post, with perfect tech stack alignment (Claude Code + Playwright + axe-core). Provides a natural learning path in comprehensive test automation: 'Complete Workflow (prerequisite) → Parallel Test Optimization (this post)'."
          },
          "type": "prerequisite"
        },
        {
          "slug": "playwright-ai-testing",
          "score": 0.88,
          "reason": {
            "ko": "Playwright + AI 기반 E2E 테스트 자동화의 기초를 다루는 포스트로, 본 포스트에서 구현한 병렬 테스트의 개별 테스트 작성 방법을 상세히 설명합니다. Auto-waiting 메커니즘, GitHub Actions CI/CD 통합, 시각적 회귀 테스트 등 본 포스트의 5가지 테스트 카테고리 중 E2E와 Performance 테스트의 기반 지식을 제공합니다. Playwright + TypeScript + GitHub Actions 기술 스택 공유로 실무 적용 시너지가 높습니다.",
            "ja": "Playwright + AI ベースのE2Eテスト自動化の基礎を扱う記事で、本記事で実装した並列テストの個別テスト作成方法を詳しく説明します。Auto-waitingメカニズム、GitHub Actions CI/CD統合、ビジュアルリグレッションテストなど、本記事の5つのテストカテゴリのうちE2EとPerformanceテストの基礎知識を提供します。Playwright + TypeScript + GitHub Actionsの技術スタック共有により、実務適用のシナジーが高いです。",
            "en": "Covers the fundamentals of Playwright + AI-based E2E test automation, providing detailed guidance on writing individual tests used in this post's parallel testing system. Offers foundational knowledge for E2E and Performance testing among the 5 test categories, including auto-waiting mechanisms, GitHub Actions CI/CD integration, and visual regression testing. High practical synergy through shared tech stack (Playwright + TypeScript + GitHub Actions)."
          },
          "type": "prerequisite"
        },
        {
          "slug": "claude-code-hooks-workflow",
          "score": 0.82,
          "reason": {
            "ko": "Claude Code Hook 시스템을 활용한 자동화 워크플로우 구축 가이드로, 본 포스트의 Task Tool 활용과 상호보완적입니다. Pre/Post Hook을 통한 코드 품질 검증(타입 체크, 린팅, 보안 스캔)과 GitHub Actions 통합이 병렬 테스트 자동화의 전체 CI/CD 파이프라인에 통합될 수 있습니다. 두 포스트 모두 Automation(0.95)과 DevOps(0.8-0.9) 점수가 높아 자동화 중심 워크플로우 설계에 관심 있는 독자에게 완벽한 조합입니다.",
            "ja": "Claude Code Hookシステムを活用した自動化ワークフロー構築ガイドで、本記事のTask Tool活用と相互補完的です。Pre/Post Hookを通じたコード品質検証(タイプチェック、リンティング、セキュリティスキャン)とGitHub Actions統合が、並列テスト自動化の全体的なCI/CDパイプラインに統合できます。両記事ともAutomation(0.95)とDevOps(0.8-0.9)スコアが高く、自動化中心のワークフロー設計に興味のある読者に完璧な組み合わせです。",
            "en": "A comprehensive guide on building automated workflows with Claude Code Hook system, complementary to this post's Task Tool usage. Pre/Post Hook-based code quality verification (type checking, linting, security scanning) and GitHub Actions integration can be seamlessly integrated into the parallel testing automation's CI/CD pipeline. Both posts score high in Automation (0.95) and DevOps (0.8-0.9), making them a perfect combination for readers interested in automation-centric workflow design."
          },
          "type": "complementary"
        },
        {
          "slug": "claude-code-web-automation",
          "score": 0.79,
          "reason": {
            "ko": "Claude Code와 Playwright MCP를 결합한 웹 자동화의 기초를 다루며, 본 포스트에서 구현한 병렬 테스트 시스템의 기반 기술을 설명합니다. 브라우저 테스트, 스크린샷 캡처, 성능 측정, UI 인터랙션 등 본 포스트의 Component/E2E/Performance 테스트 카테고리와 직접 연결됩니다. Claude Code + Playwright + Chrome DevTools 기술 스택의 공통점으로 자연스러운 학습 곡선을 제공하며, 난이도 3에서 4로의 점진적 발전 경로를 만듭니다.",
            "ja": "Claude CodeとPlaywright MCPを組み合わせたWeb自動化の基礎を扱い、本記事で実装した並列テストシステムの基盤技術を説明します。ブラウザテスト、スクリーンショットキャプチャ、パフォーマンス測定、UIインタラクションなど、本記事のComponent/E2E/Performanceテストカテゴリと直接つながります。Claude Code + Playwright + Chrome DevToolsの技術スタックの共通点により自然な学習曲線を提供し、難易度3から4への段階的な発展パスを作ります。",
            "en": "Covers the fundamentals of web automation combining Claude Code and Playwright MCP, explaining the foundational technologies of this post's parallel testing system. Directly connects to Component/E2E/Performance test categories through browser testing, screenshot capture, performance measurement, and UI interactions. Provides a natural learning curve through shared tech stack (Claude Code + Playwright + Chrome DevTools) and creates a progressive development path from difficulty 3 to 4."
          },
          "type": "prerequisite"
        },
        {
          "slug": "astro-scheduled-publishing",
          "score": 0.71,
          "reason": {
            "ko": "Astro 정적 사이트의 GitHub Actions 기반 자동화 시스템으로, 본 포스트의 CI/CD 파이프라인 통합과 유사한 워크플로우를 다룹니다. GitHub Actions 스케줄링, 자동 빌드/배포 패턴이 병렬 테스트 자동화의 CI 통합에 직접 적용 가능하며, 두 포스트 모두 Automation(0.85+)과 DevOps(0.8+) 점수가 높습니다. 테스트 자동화와 배포 자동화를 결합하여 완전한 DevOps 파이프라인을 구축하려는 독자에게 유용한 보완 자료입니다.",
            "ja": "Astro静的サイトのGitHub Actionsベース自動化システムで、本記事のCI/CDパイプライン統合と類似したワークフローを扱います。GitHub Actionsスケジューリング、自動ビルド/デプロイパターンが並列テスト自動化のCI統合に直接適用可能で、両記事ともAutomation(0.85+)とDevOps(0.8+)スコアが高いです。テスト自動化とデプロイ自動化を組み合わせて完全なDevOpsパイプラインを構築したい読者に有用な補完資料です。",
            "en": "An Astro static site's GitHub Actions-based automation system covering similar workflows to this post's CI/CD pipeline integration. GitHub Actions scheduling and auto build/deploy patterns are directly applicable to parallel test automation CI integration, with both posts scoring high in Automation (0.85+) and DevOps (0.8+). Useful complementary material for readers looking to build a complete DevOps pipeline combining test automation with deployment automation."
          },
          "type": "complementary"
        }
      ],
      "generatedAt": "2025-10-29T10:24:33.959Z",
      "evaluatedBy": "claude-sonnet-4.5"
    }
  },
  "metadata": {
    "totalPosts": 28,
    "lastGenerated": "2025-10-29T10:24:33.960Z",
    "modelVersion": "claude-sonnet-4.5",
    "minThreshold": 0.3,
    "maxRecommendations": 5,
    "generation": {
      "processedPosts": 1,
      "skippedPosts": 27,
      "averageRecommendations": "4.9",
      "totalDuration": "~10s"
    }
  }
}